# -*- coding: utf-8 -*-
import Strategy


def action(chat_id, bot):
    bot.send_message(chat_id, """Інструкція, як правильно користуватись:
            щоб додати справу до списку потрібно скористатись командою /new, наприклад:
                        /new прочитати книжку на Середу з високою важливістю
                        /new намалювати щось на Понеділок(або інший день тижня) з низькою важливістю
                        з низькою(високою) важливістю - це обовязкове закінчення команди /new
            Коли прийде час виконання завдання, я надішлю вам звістку
Повний список команд:
/new - читай вище
/all - надішлю вам ваш список справ
/delete номер - видалить номер виконаної справи!!""")


class HelpCommand(Strategy.BotStrategy):
    def __init__(self):
        pass
